[WOTC_KPP_PerkTest X2SoldierClassTemplate]
DisplayName = "Perk 测试"
ClassSummary ="该课程的存在是为了测试Knox's Perk Pack中的能力"
+AbilityTreeTitles = "A 列"
+AbilityTreeTitles ="B 列"
+AbilityTreeTitles ="C 列"
+AbilityTreeTitles ="D 列"

; - 突击兵 -

[KPP_BreachingEntry X2AbilityTemplate]
LocFriendlyName ="破坏条目"
LocHelpText = "激活此能力后，将通过自由动作投掷或发射下一枚手榴弹，<font color='#3ABD23'><Ability:BREACHING_ENTRY_COOLDOWN/></font> 进入冷却时间。"
LocLongDescription = "激活此能力后，将通过自由动作投掷或发射下一颗手榴弹，<font color='#3ABD23'><Ability:BREACHING_ENTRY_COOLDOWN/></font> 冷却。取代准备进入。"
LocPromotionPopupText = "激活此能力后，将通过自由动作投掷或发射下一颗手榴弹，<font color='#3ABD23'><Ability:BREACHING_ENTRY_COOLDOWN/></font> 冷却。取代准备进入。"

[KPP_BreachingEntrySolo X2AbilityTemplate]
LocFriendlyName ="破坏条目"
LocHelpText = "激活此能力后，将通过自由动作投掷或发射下一枚手榴弹，<font color='#3ABD23'><Ability:BREACHING_ENTRY_COOLDOWN/></font> 进入冷却时间。"
LocLongDescription ="激活此能力后，将通过自由动作投掷或发射下一枚手榴弹，<font color='#3ABD23'><Ability:BREACHING_ENTRY_COOLDOWN/></font>冷却。"
LocPromotionPopupText = "激活此能力后，将通过自由动作投掷或发射下一枚手榴弹，<font color='#3ABD23'><Ability:BREACHING_ENTRY_COOLDOWN/></font> 进入冷却时间。"

[KPP_GrenadeBelt X2AbilityTemplate]
LocFriendlyName ="手榴弹腰带"
LocHelpText = "<Ability:ClassName/> 在冷却时获得 3 个特种手榴弹。此外，大多数手榴弹都会获得 <font color='#3ABD23'>+<Ability:GRENADE_BELT_CHARGE_BONUS/></font> 蓄力。"
LocLongDescription = "<Ability:ClassName/> 在冷却时获得 3 个特种手榴弹。此外，大多数手榴弹会获得 <font color='#3ABD23'>+<Ability:GRENADE_BELT_CHARGE_BONUS/></font> 电荷。特种手榴弹不受准备进入或突破进入。"
LocPromotionPopupText = "<Ability:ClassName/> 在冷却时获得 3 颗特种手榴弹。此外，大多数手榴弹会获得 <font color='#3ABD23'>+<Ability:GRENADE_BELT_CHARGE_BONUS/></font> 电荷。特种手榴弹不受准备进入或突破入口。<br/><子弹/>获得脉冲手榴弹（投掷一枚手榴弹，造成 4-6 点伤害并眩晕敌方单位 1 回合）。<br/><br/><子弹/>获得迷雾手榴弹（投掷一颗手榴弹，造成 2-4 点伤害，并使敌人致盲 1 回合）。<br/><br/><子弹/> 获得曲速手榴弹（投掷一颗手榴弹，撕碎 4 点护甲值，不造成任何伤害，并且具有小爆炸半径）。<br/><br/><font color='#CA7200'>每种手榴弹类型不共享冷却时间</font>。"

[GrenadeThrow X2AbilityTemplate]
LocFriendlyName ="投掷手榴弹"
LocHelpText = "向目标区域投掷一枚手榴弹。"

[KPPGrenadePulse X2GrenadeTemplate]
FriendlyName="脉冲手榴弹"
FriendlyNamePlural="脉冲手榴弹"
BriefSummary="投掷一颗脉冲手榴弹，使敌人昏迷，有 8 回合冷却时间。"
TacticalText="<Bullet/> 脉冲手榴弹可击晕敌人 2 次。<br><Bullet/> 友方小队成员不会受到影响。"
ThrownAbilityName="投掷脉冲手榴弹"
ThrownAbilityHelpText="眩晕受影响区域内的所有敌对目标。"
LaunchedAbilityname="发射脉冲手榴弹"
LaunchedAbilityHelpText="击晕受影响区域内的所有敌对目标。"

[KPPGrenadeMist X2GrenadeTemplate]
FriendlyName="迷雾手榴弹"
FriendlyNamePlural="迷雾手榴弹"
BriefSummary="投掷一枚迷雾手榴弹，使敌人严重致盲，有 8 回合冷却时间。友方小队成员不会受到影响。"
TacticalText="<Bullet/> 迷雾手榴弹使敌人致盲 1 回合。<br><Bullet/> 友方小队成员不会受到影响。"
ThrownAbilityName="投掷雾气手榴弹"
ThrownAbilityHelpText="致盲受影响区域内的所有敌对目标。"
LaunchedAbilityname="发射迷雾手榴弹"
LaunchedAbilityHelpText="致盲受影响区域内的所有敌对目标。"

[KPPGrenadeWarp X2GrenadeTemplate]
FriendlyName="曲速手榴弹"
FriendlyNamePlural="曲速手榴弹"
BriefSummary="投掷一枚曲速手榴弹，撕碎 4 点护甲，不造成任何伤害，有 8 回合冷却时间。友好的小队成员不会受到影响。"
TacticalText="<Bullet/> 曲速手榴弹会粉碎目标上的 4 点护甲。<br><Bullet/> 友方小队成员不会受到影响。"
ThrownAbilityName="投掷扭曲手榴弹"
ThrownAbilityHelpText="粉碎受影响区域内敌方目标的 4 块护甲。"
LaunchedAbilityname="发射曲速手榴弹"
LaunchedAbilityHelpText="粉碎受影响区域内敌方目标的 4 块护甲。"

[KPP_ProximityGrenade X2AbilityTemplate]
LocFriendlyName ="近距离炸药"
LocHelpText = "<Ability:ClassName/> 获得 <font color='#3ABD23'><Ability:PROXIMITY_CHARGE_BONUS/></font> 近地雷，当敌人在附近时会引爆。"
LocLongDescription = "<Ability:ClassName/> 获得 <font color='#3ABD23'><Ability:PROXIMITY_CHARGE_BONUS/></font> 近地雷，当敌人在附近时会引爆。"
LocPromotionPopupText = "<Ability:ClassName/> 获得 <font color='#3ABD23'><Ability:PROXIMITY_CHARGE_BONUS/></font> 近地雷，当敌人在附近时会引爆。"

[KPP_QuickLoad X2AbilityTemplate]
LocFriendlyName ="快速加载"
LocHelpText = "当蹲下时，<Ability:ClassName/> 会在其主回合中重新加载 <font color='#3ABD23'><Ability:QUICK_LOAD_AMMO_TO_RELOAD/></font> 回合。"
LocLongDescription = "当蹲下时，<Ability:ClassName/> 会在其主回合中重新加载 <font color='#3ABD23'><Ability:QUICK_LOAD_AMMO_TO_RELOAD/></font> 回合。"
LocPromotionPopupText = "当蹲下时，<Ability:ClassName/> 会在第一回合中重新加载 <font color='#3ABD23'><Ability:QUICK_LOAD_AMMO_TO_RELOAD/></font> 回合。"

[KPP_MistGrenade X2AbilityTemplate]
LocFriendlyName ="雾气手榴弹套件"
LocHelpText = "<Ability:ClassName/> 获得迷雾手榴弹，一种特殊手榴弹，冷却时间为 8 回合。迷雾手榴弹严重致盲敌人 1 回合。友方小队成员不会受到影响。"
LocLongDescription = "<Ability:ClassName/> 获得迷雾手榴弹，一种特殊手榴弹，冷却时间为 8 回合。迷雾手榴弹严重致盲敌人 1 回合。友方小队成员不会受到影响。"
LocPromotionPopupText = "<Ability:ClassName/> 获得迷雾手榴弹，一种特殊手榴弹，冷却时间为 8 回合。迷雾手榴弹严重致盲敌人 1 回合。友方小队成员不会受到影响。"

[KPP_WarpGrenade X2AbilityTemplate]
LocFriendlyName ="扭曲手榴弹套件"
LocHelpText = "<Ability:ClassName/> 获得扭曲手榴弹，这是一种需要 8 回合冷却时间的特种手榴弹。扭曲手榴弹会撕碎 4 点护甲，但不会造成伤害。友方小队成员不会受到影响。"
LocLongDescription = "<Ability:ClassName/> 获得扭曲手榴弹，这是一种需要 8 回合冷却时间的特种手榴弹。扭曲手榴弹会撕碎 4 点护甲，但不会造成任何伤害。友方小队成员不会受到影响。"
LocPromotionPopupText = "<Ability:ClassName/> 获得扭曲手榴弹，一种特殊手榴弹，冷却时间为 8 回合。扭曲手榴弹撕碎 4 点护甲，但不造成伤害。友方小队成员不会受到影响。"

[KPP_PulseGrenade X2AbilityTemplate]
LocFriendlyName ="脉冲手榴弹套件"
LocHelpText = "<Ability:ClassName/> 获得脉冲手榴弹，这是一种 8 回合冷却时间的特种手榴弹。脉冲手榴弹可击晕敌人 2 次。友方小队成员不会受到影响。"
LocLongDescription = "<Ability:ClassName/> 获得脉冲手榴弹，这是一种 8 回合冷却时间的特种手榴弹。脉冲手榴弹可击晕敌人 2 次。友方小队成员不会受到影响。"
LocPromotionPopupText = "<Ability:ClassName/> 获得脉冲手榴弹，一种特殊手榴弹，冷却时间为 8 回合。脉冲手榴弹可击晕敌人 2 次。友方小队成员不会受到影响。"

; - 典狱长 -

[KPP_Lockdown X2AbilityTemplate]
LocFriendlyName ="锁定"
LocHelpText = "<Ability:ClassName/> 将对手锁定在原地，并通过 <font color='#3ABD23'><Ability:LOCKDOWN_STUN_ACTIONS/></font> 动作将其击晕，<font color='#3ABD23'><能力：LOCKDOWN_COOLDOWN/></font> 开启冷却时间。"
LocLongDescription = "<Ability:ClassName/> 将对手锁定在原地，并通过 <font color='#3ABD23'><Ability:LOCKDOWN_STUN_ACTIONS/></font> 动作将其击晕，<font color='#3ABD23'><能力：LOCKDOWN_COOLDOWN/></font> 开启冷却时间。"
LocPromotionPopupText = "<Ability:ClassName/> 将对手锁定在原地，并通过 <font color='#3ABD23'><Ability:LOCKDOWN_STUN_ACTIONS/></font> 动作将其击晕，<font color='#3ABD23'><能力：LOCKDOWN_COOLDOWN/></font> 开启冷却时间。"

[KPP_WarpShield X2AbilityTemplate]
LocFriendlyName ="扭曲护盾"
LocFlyOverText ="扭曲护盾"
LocHelpText = "<Ability:ClassName/> 操纵虚空，将自己传送到 <font color='#3ABD23'><Ability:WARP_SHIELD_RANGE/></font> 方块内的附近位置并提供 <font color='#3ABD23 '><Ability:WARP_SHIELD_HP/></font> 为附近盟友提供 HP 护盾。"
LocLongDescription = "<Ability:ClassName/> 操纵虚空，将自己传送到 <font color='#3ABD23'><Ability:WARP_SHIELD_RANGE/></font> 方块内的附近位置并提供 <font color='#3ABD23 '><Ability:WARP_SHIELD_HP/></font> 为附近盟友提供 HP 护盾。"
LocPromotionPopupText = "<Ability:ClassName/> 操纵虚空，将自己传送到 <font color='#3ABD23'><Ability:WARP_SHIELD_RANGE/></font> 方块内的附近位置并提供 <font color='#3ABD23 '><Ability:WARP_SHIELD_HP/></font> 为附近盟友提供生命值护盾，可与移动动作一起使用。"

[KPP_BulwarkStrength X2AbilityTemplate]
LocFriendlyName ="壁垒力量"
LocFlyOverText ="壁垒力量"
LocHelpText = "<Ability:ClassName/> 增强盟友的力量，为他们提供<font color='#3ABD23'><Ability:BULWARK_SHIELD_HP/></font>护盾生命值，增加他们的防御<font color='#3ABD23' ><Ability:BULWARK_DEFENSE/></font>，并在链接持续期间为他们提供<font color='#3ABD23'><Ability:BULWARK_ARMOR/></font>护甲如果用户死亡，则链接的盟友。也会死亡。可以通过一个自由动作移除链接，<font color='#3ABD23'><Ability:BULWARK_COOLDOWN/></font> 进入冷却时间。"
LocLongDescription = "<Ability:ClassName/> 增强盟友的力量，为他们提供<font color='#3ABD23'><Ability:BULWARK_SHIELD_HP/></font>护盾生命值，增加他们的防御<font color='#3ABD23' ><Ability:BULWARK_DEFENSE/></font>，并在链接持续期间为他们提供<font color='#3ABD23'><Ability:BULWARK_ARMOR/></font>护甲如果用户死亡，则链接的盟友。也会死亡。可以通过一个自由动作移除链接，<font color='#3ABD23'><Ability:BULWARK_COOLDOWN/></font> 进入冷却时间。"
LocPromotionPopupText = "<Ability:ClassName/> 增强盟友的力量，为他们提供<font color='#3ABD23'><Ability:BULWARK_SHIELD_HP/></font>护盾生命值，增加他们的防御<font color='#3ABD23' ><Ability:BULWARK_DEFENSE/></font>，并在链接持续期间为他们提供<font color='#3ABD23'><Ability:BULWARK_ARMOR/></font>护甲如果用户死亡，则链接的盟友。也会死亡。可以通过一个自由动作移除链接，<font color='#3ABD23'><Ability:BULWARK_COOLDOWN/></font> 进入冷却时间。"

[KPP_BulwarkStrengthRelease X2AbilityTemplate]
LocFriendlyName = "释放连接"
LocFlyOverText = "释放连接"
LocHelpText = "<Ability:ClassName/> 向盟友释放灵能连接，移除壁垒力量。"
LocLongDescription = "<Ability:ClassName/>向盟友释放灵能连接，移除壁垒力量。"
LocPromotionPopupText = "<Ability:ClassName/>向盟友释放灵能连接，移除壁垒力量。"

[KPP_Barrier X2AbilityTemplate]
LocFriendlyName ="屏障"
LocFlyOverText ="屏障"
LocHelpText = "提供一名盟友<font color='#3ABD23'><Ability:BARRIER_SHIELD_HP/></font>护盾生命值1回合。<font color='#3ABD23'><Ability:BARRIER_COOLDOWN/></font>转冷却。"
LocLongDescription = "提供一名盟友<font color='#3ABD23'><Ability:BARRIER_SHIELD_HP/></font>护盾生命值1回合。<font color='#3ABD23'><Ability:BARRIER_COOLDOWN/></font>转冷却。"
LocPromotionPopupText = "为一名盟友提供<font color='#3ABD23'><Ability:BARRIER_SHIELD_HP/></font>护盾生命值1回合。该盟友将在XCOM的下一回合失去护盾。<font color='#3ABD23' ><Ability:BARRIER_COOLDOWN/></font> 开启冷却时间。"

[KPP_PiercingStrikes X2AbilityTemplate]
LocFriendlyName ="穿刺攻击"
LocFlyOverText ="穿刺攻击"
LocHelpText = "<Ability:ClassName/>的主要、次要和近战攻击现在可以刺穿<font color='#3ABD23'><Ability:PIERCING_STRIKES_PIERCE/></font>护甲。"
LocLongDescription = "<Ability:ClassName/>的主要、次要和近战攻击现在可以刺穿<font color='#3ABD23'><Ability:PIERCING_STRIKES_PIERCE/></font>护甲。"
LocPromotionPopupText = "<Ability:ClassName/>的主要、次要和近战攻击现在可以刺穿<font color='#3ABD23'><Ability:PIERCING_STRIKES_PIERCE/></font>护甲。"

[KPP_MassStasis X2AbilityTemplate]
LocFriendlyName ="质量停滞"
LocFlyOverText ="质量停滞"
LocHelpText = "<Ability:ClassName/> 锁定目标敌人以及 <font color='#3ABD23'><Ability:MASS_STASIS_RADIUS_METERS/></font> 方块内的所有单位，迫使他们进入静止状态。<font color ='#3ABD23'><Ability:MASS_STASIS_COOLDOWN/></font> 冷却时间如果解锁了停滞护盾，施法者可以瞄准盟友。"
LocLongDescription = "<Ability:ClassName/> 锁定目标敌人以及 <font color='#3ABD23'><Ability:MASS_STASIS_RADIUS_METERS/></font> 格内的所有单位，迫使他们进入静止状态。<font color ='#3ABD23'><Ability:MASS_STASIS_COOLDOWN/></font> 冷却时间如果解锁了停滞护盾，施法者可以瞄准盟友。"
LocPromotionPopupText = "<Ability:ClassName/> 锁定目标敌人以及<font color='#3ABD23'><Ability:MASS_STASIS_RADIUS_METERS/></font> 格内的所有单位，迫使他们进入静止状态。<font color ='#3ABD23'><Ability:MASS_STASIS_COOLDOWN/></font> 冷却时间如果解锁了停滞护盾，施法者可以瞄准盟友。"

; - 火箭手 -

[KPP_LightweightRockets X2AbilityTemplate]
LocFriendlyName ="火箭装置"
LocHelpText = "<Ability:ClassName/> 独特的装甲装备允许他们携带火箭而不会受到移动性惩罚。此外，在战术期间还可以免费获得一枚火箭。"
LocLongDescription = "<Ability:ClassName/> 独特的装甲装备允许他们携带火箭而不会受到移动性惩罚。此外，在战术期间还可以免费获得一枚火箭。"
LocPromotionPopupText = "与其他职业不同，<Ability:ClassName/> 不会因携带火箭而受到移动惩罚，无论他们携带多少火箭。此外，在战术期间还会获得一枚免费火箭。"

[KPP_RocketRig X2AbilityTemplate]
LocFriendlyName ="火箭装置"
LocHelpText = "<Ability:ClassName/> 独特的装甲装备允许他们携带火箭而不会受到移动能力的影响。"
LocLongDescription = "<Ability:ClassName/> 独特的装甲装备允许他们携带火箭而不会受到移动性惩罚。"
LocPromotionPopupText = "与其他职业不同，<Ability:ClassName/> 不会因携带火箭而受到移动惩罚，无论携带多少火箭。"

; - 圣殿骑士 -

[KPP_Deflect X2AbilityTemplate]
LocFriendlyName="偏转"
LocFlyOverText="偏转"
LocLongDescription="获得 <font color='#3ABD23'><Ability:DEFLECT_CHANCE/>%</font> 几率偏转传入攻击，消除所有伤害。每回合可触发多次。"
LocHelpText="获得 <font color='#3ABD23'><Ability:DEFLECT_CHANCE/>%</font> 几率偏转传入攻击，消除所有伤害。每回合可触发多次。"
LocPromotionPopupText="获得 <font color='#3ABD23'><Ability:DEFLECT_CHANCE/>%</font> 几率偏转传入攻击，消除所有伤害。每回合可触发多次。"

[KPP_FracturingStrike X2AbilityTemplate]
LocFriendlyName ="断裂打击"
LocFlyOverText ="断裂打击"
LocHelpText = "<Ability:ClassName/> 将灵能能量注入其护手中，造成 <font color='#3ABD23'>+<Ability:FRACTURE_RUPTURE/></font> 点伤害并撕裂目标 <font color='#3ABD23 '>+<Ability:FRACTURE_RUPTURE/></font> 触发动量。"
LocLongDescription = "<Ability:ClassName/> 将灵能能量注入他们的护手中，造成 <font color='#3ABD23'>+<Ability:FRACTURE_RUPTURE/></font> 点伤害并让目标破裂 <font color='#3ABD23 '>+<Ability:FRACTURE_RUPTURE/></font> 伤害，有 <font color='#3ABD23'><Ability:FRACTURE_COOLDOWN/></font> 回合触发动量。"
LocPromotionPopupText = "<Ability:ClassName/> 将灵能能量注入他们的护手中，造成 <font color='#3ABD23'>+<Ability:FRACTURE_RUPTURE/></font> 点伤害并让目标破裂 <font color='#3ABD23 '>+<Ability:FRACTURE_RUPTURE/></font> 伤害，有 <font color='#3ABD23'><Ability:FRACTURE_COOLDOWN/></font> 回合触发动量。"

[KPP_Overcharge X2AbilityTemplate]
LocFriendlyName ="灵能过载"
LocFlyOverText = "灵能过载"
LocHelpText = "<Ability:ClassName/> 赋予自己灵能能量，为他们提供 <font color='#3ABD23'>+<Ability:OVERCHARGE_DAMAGE_BONUS/></font> 伤害，并在刺穿时为每次近战击杀返还他们的行动<font color='#3ABD23'><Ability:OVERCHARGE_PIERCE/></font> 护甲，回合结束后，他们会被眩晕 2 次。"
LocLongDescription = "<Ability:ClassName/> 赋予自己灵能能量，为他们提供 <font color='#3ABD23'>+<Ability:OVERCHARGE_DAMAGE_BONUS/></font> 伤害，并在刺穿时为每次近战击杀返还他们的行动<font color='#3ABD23'><Ability:OVERCHARGE_PIERCE/></font> 护甲，回合结束后，他们会被眩晕 2 次。"
LocPromotionPopupText = "<Ability:ClassName/> 赋予自己灵能能量，为他们提供 <font color='#3ABD23'>+<Ability:OVERCHARGE_DAMAGE_BONUS/></font> 伤害，并在刺穿时为每次近战击杀返还他们的行动<font color='#3ABD23'><Ability:OVERCHARGE_PIERCE/></font> 护甲，回合结束后，他们会被眩晕 2 次。"

[KPP_QuickStrike X2AbilityTemplate]
LocFriendlyName ="快速打击"
LocFlyOverText ="快速攻击"
LocHelpText = "<Ability:ClassName/>冲向他们的对手，进行一次快速打击，花费 1 个动作。触发动力。"
LocLongDescription = "<Ability:ClassName/> 冲向对手，进行快速打击，花费 1 个动作。有 <font color='#3ABD23'><Ability:QUICK_STRIKE_COOLDOWN/></font> 回合冷却时间。触发动量"。
LocPromotionPopupText = "<Ability:ClassName/> 冲向对手，进行一次快速打击，花费 1 个动作。有 <font color='#3ABD23'><Ability:QUICK_STRIKE_COOLDOWN/></font> 回合冷却时间。触发动量"。

[KPP_Warp X2AbilityTemplate]
LocFriendlyName ="扭曲"
LocFlyOverText ="扭曲"
LocHelpText = "<Ability:ClassName/> 操纵虚空，将自己传送到 <font color='#3ABD23'><Ability:WARP_RANGE/></font> 方块内的附近位置，自由行动。"
LocLongDescription = "<Ability:ClassName/> 操纵虚空，将自己传送到 <font color='#3ABD23'><Ability:WARP_RANGE/></font> 方块内的附近位置，自由行动。"
LocPromotionPopupText = "<Ability:ClassName/> 操纵虚空，将自己传送到 <font color='#3ABD23'><Ability:WARP_RANGE/></font> 方块内的附近位置，自由行动。<font color=' #3ABD23'><Ability:WARP_COOLDOWN/></font> 降低冷却时间，可与移动或动量动作一起使用。"

[KPP_Warp_XCOM X2AbilityTemplate]
LocFriendlyName ="扭曲"
LocFlyOverText ="扭曲"
LocHelpText = "<Ability:ClassName/> 操纵虚空，将自己传送到 <font color='#3ABD23'><Ability:WARP_RANGE/></font> 方块内的附近位置，自由行动。"
LocLongDescription = "<Ability:ClassName/> 操纵虚空，将自己传送到 <font color='#3ABD23'><Ability:WARP_RANGE/></font> 方块内的附近位置，自由行动。"
LocPromotionPopupText = "<Ability:ClassName/> 操纵虚空，将自己传送到 <font color='#3ABD23'><Ability:WARP_RANGE/></font> 方块内的附近位置。<font color='#3ABD23' ><Ability:WARP_COOLDOWN/></font> 降低冷却时间，可与移动或动量动作一起使用。"

[KPP_DevourX2AbilityTemplate]
LocFriendlyName ="吞噬"
LocFlyOverText ="吞噬"
LocHelpText = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲冷却时间。"
LocLongDescription = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲冷却时间。"
LocPromotionPopupText = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲值，立即杀死生命值低于 3 的敌人。"

[KPP_Devour_XCOM X2AbilityTemplate]
LocFriendlyName ="吞噬"
LocFlyOverText ="吞噬"
LocHelpText = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲冷却时间。"
LocLongDescription = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲冷却时间。"
LocPromotionPopupText = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲值，立即杀死生命值低于 3 的敌人。"


[KPP_Ghost X2AbilityTemplate]
LocFriendlyName ="幽灵"
LocFlyOverText ="幽灵"
LocHelpText = "<Ability:ClassName/> 从倒下的类人生物的身体中创造出自己的灵能幽灵。幽灵会在整个任务中持续存在，只有在它或施法者死亡时才会消失。幽灵无法使用某些能力。 "
LocLongDescription = "<Ability:ClassName/>从一个倒下的类人生物的身体中创造出一个自己的灵能幽灵。幽灵会在整个任务中持续存在，只有在它或施法者死亡时才会消失。幽灵无法使用某些能力。 "
LocPromotionPopupText = "<Ability:ClassName/> 从一个倒下的类人生物的身体中创造出一个自己的灵能幽灵。幽灵会在整个任务中持续存在，只有在它或施法者死亡时才会消失。<br/><Bullet/>幽灵无法使用幽灵、灵能过度充能、神圣战士和激励。幽灵拥有 <font color='#3ABD23'><Ability:GhostHPPerFocus/></font> HP。<br/><Bullet/>幽灵。能够在活着的时候与某些物体和目标进行交互。"

[KPP_AgileStep X2AbilityTemplate]
LocFriendlyName ="敏捷步"
LocFlyOverText ="敏捷步"
LocHelpText = "<Ability:ClassName/> 具有 <font color='#3ABD23'>+<Ability:AGILE_STEP_MOBILITY/></font> 移动能力，并且能够爬墙。"
LocLongDescription = "<Ability:ClassName/> 具有 <font color='#3ABD23'>+<Ability:AGILE_STEP_MOBILITY/></font> 移动能力，并且能够爬墙。"
LocPromotionPopupText = "<Ability:ClassName/> 具有 <font color='#3ABD23'>+<Ability:AGILE_STEP_MOBILITY/></font> 移动能力，并且能够爬墙。"

[KPP_UnendingHunger X2AbilityTemplate]
LocFriendlyName ="无尽的饥饿"
LocFlyOverText ="无尽的饥饿"
LocHelpText ="改善吞噬，使其具有增强效果：吞噬现在恢复+4生命值，并且可以对生命值等于或低于5的敌人使用。"
LocLongDescription ="改善吞噬，使其具有增强效果：吞噬现在恢复+4生命值，并且可以对生命值等于或低于5的敌人使用。"
LocPromotionPopupText = "改善吞噬，使其具有增强效果：吞噬现在恢复 +4 HP，可用于生命值 5 或更低的敌人。"

[KPP_UnendingDevour X2AbilityTemplate]
LocFriendlyName ="吞噬：无尽的饥饿"
LocFlyOverText ="吞噬：无尽的饥饿"
LocHelpText = "<Ability:ClassName/> 消耗垂死对手留下的灵能，恢复 +4 HP，只能对生命值 5 或更低的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/ ></font> 忽略护甲。"
LocLongDescription = "<Ability:ClassName/> 消耗垂死对手留下的灵能，恢复 +4 HP，只能对生命值 5 或更低的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/ ></font> 忽略护甲。"
LocPromotionPopupText = "<Ability:ClassName/> 消耗垂死对手留下的灵能，恢复 +4 HP，只能对生命值 5 或更低的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/ ></font> 忽略冷却时间。将立即杀死生命值不超过 5 的敌人。"

[KPP_SearingHunger X2AbilityTemplate]
LocFriendlyName ="灼热的饥饿"
LocFlyOverText ="灼热的饥饿"
LocHelpText ="改进吞噬，使其具有增强的效果：吞噬现在只需单个动作即可使用，并且可以与移动动作一起使用。"
LocLongDescription ="改善吞噬，使其具有增强的效果：吞噬现在只需一个动作即可使用，并且可以与移动动作一起使用。"
LocPromotionPopupText = "改善吞噬，使其具有增强的效果：吞噬现在只需一个动作即可使用，并且可以与移动动作一起使用。"

[KPP_SearingDevour X2AbilityTemplate]
LocFriendlyName ="吞噬：灼热的饥饿"
LocFlyOverText ="吞噬：灼热的饥饿"
LocHelpText = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲冷却时间，可与移动动作一起使用。"
LocLongDescription = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲冷却时间，可与移动动作一起使用。"
LocPromotionPopupText = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲，可与移动动作一起使用，立即杀死生命值为 3 或更低的敌人。"

[KPP_PervadingHunger X2AbilityTemplate]
LocFriendlyName ="普遍的饥饿"
LocFlyOverText ="普遍的饥饿"
LocHelpText = "改进吞噬，使其具有增强的效果：吞噬现在会在目标上引爆灵能爆炸，不会对盟友造成伤害，并且不再仅限于 3 个 HP 目标。"
LocLongDescription ="改进吞噬，使其具有增强的效果：吞噬现在会在目标上引爆灵能爆炸，不会对盟友造成伤害，并且不再限制为 3 个 HP 目标。"
LocPromotionPopupText = "改进吞噬，使其具有增强的效果：吞噬现在会在目标上引爆灵能爆炸，不会对盟友造成伤害，并且不再仅限于 3 个 HP 目标。"

[KPP_PervadingDevour X2AbilityTemplate]
LocFriendlyName ="吞噬：弥漫的饥饿"
LocFlyOverText ="吞噬：弥漫的饥饿"
LocHelpText = "<Ability:ClassName/> 消耗垂死对手留下的灵能能量，并发射灵能爆炸，对 <font color='#3ABD23'><Ability:PERVADING_DEVOUR_RADIUS/> 范围内的周围敌人造成 3 点伤害</ font> 方块，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font> 忽略冷却时间不会伤害附近的盟友。"
LocLongDescription = "<Ability:ClassName/> 会消耗垂死对手留下的灵能能量，并发射灵能爆炸，对 <font color='#3ABD23'><Ability:PERVADING_DEVOUR_RADIUS/> 范围内的周围敌人造成 3 点伤害</ font> 方块，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font> 忽略冷却时间不会伤害附近的盟友。"
LocPromotionPopupText = "<Ability:ClassName/> 消耗垂死对手留下的灵能能量，并发射灵能爆炸，对 <font color='#3ABD23'><Ability:PERVADING_DEVOUR_RADIUS/> 范围内的周围敌人造成 3 点伤害</ font> 方块，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font> 忽略冷却时间不会伤害附近的盟友。"

[KPP_UnendingHungerXCOM X2AbilityTemplate]
LocFriendlyName ="无尽的饥饿"
LocFlyOverText ="无尽的饥饿"
LocHelpText ="改善吞噬，使其具有增强效果：吞噬现在恢复+4生命值，并且可以对生命值等于或低于5的敌人使用。"
LocLongDescription ="改善吞噬，使其具有增强效果：吞噬现在恢复+4生命值，并且可以对生命值等于或低于5的敌人使用。"
LocPromotionPopupText = "改善吞噬，使其具有增强效果：吞噬现在恢复 +4 HP，可用于生命值 5 或更低的敌人。"

[KPP_UnendingDevourXCOM X2AbilityTemplate]
LocFriendlyName ="吞噬：无尽的饥饿"
LocFlyOverText ="吞噬：无尽的饥饿"
LocHelpText = "<Ability:ClassName/> 消耗垂死对手留下的灵能，恢复 +4 HP，只能对生命值 5 或更低的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/ ></font> 忽略护甲。"
LocLongDescription = "<Ability:ClassName/> 消耗垂死对手留下的灵能，恢复 +4 HP，只能对生命值 5 或更低的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/ ></font> 忽略护甲。"
LocPromotionPopupText = "<Ability:ClassName/> 消耗垂死对手留下的灵能，恢复 +4 HP，只能对生命值 5 或更低的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/ ></font> 忽略冷却时间。将立即杀死生命值不超过 5 的敌人。"

[KPP_SearingHungerXCOM X2AbilityTemplate]
LocFriendlyName ="灼热的饥饿"
LocFlyOverText ="灼热的饥饿"
LocHelpText ="改进吞噬，使其具有增强的效果：吞噬现在只需单个动作即可使用，并且可以与移动动作一起使用。"
LocLongDescription ="改善吞噬，使其具有增强的效果：吞噬现在只需一个动作即可使用，并且可以与移动动作一起使用。"
LocPromotionPopupText = "改善吞噬，使其具有增强的效果：吞噬现在只需一个动作即可使用，并且可以与移动动作一起使用。"

[KPP_SearingDevourXCOM X2AbilityTemplate]
LocFriendlyName ="吞噬：灼热的饥饿"
LocFlyOverText ="吞噬：灼热的饥饿"
LocHelpText = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲冷却时间，可与移动动作一起使用。"
LocLongDescription = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲冷却时间，可与移动动作一起使用。"
LocPromotionPopupText = "<Ability:ClassName/> 会消耗垂死对手留下的灵能，只能对生命值低于 3 的敌人使用，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font>忽略护甲，可与移动动作一起使用，立即杀死生命值为 3 或更低的敌人。"

[KPP_PervadingHungerXCOM X2AbilityTemplate]
LocFriendlyName ="普遍的饥饿"
LocFlyOverText ="普遍的饥饿"
LocHelpText = "改进吞噬，使其具有增强的效果：吞噬现在会在目标上引爆灵能爆炸，不会对盟友造成伤害，并且不再仅限于 3 个 HP 目标。"
LocLongDescription ="改进吞噬，使其具有增强的效果：吞噬现在会在目标上引爆灵能爆炸，不会对盟友造成伤害，并且不再限制为 3 个 HP 目标。"
LocPromotionPopupText = "改进吞噬，使其具有增强的效果：吞噬现在会在目标上引爆灵能爆炸，不会对盟友造成伤害，并且不再仅限于 3 个 HP 目标。"

[KPP_PervadingDevourXCOM X2AbilityTemplate]
LocFriendlyName ="吞噬：弥漫的饥饿"
LocFlyOverText ="吞噬：弥漫的饥饿"
LocHelpText = "<Ability:ClassName/> 消耗垂死对手留下的灵能能量，并发射灵能爆炸，对 <font color='#3ABD23'><Ability:PERVADING_DEVOUR_RADIUS/> 范围内的周围敌人造成 3 点伤害</ font> 方块，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font> 忽略冷却时间不会伤害附近的盟友。"
LocLongDescription = "<Ability:ClassName/> 会消耗垂死对手留下的灵能能量，并发射灵能爆炸，对 <font color='#3ABD23'><Ability:PERVADING_DEVOUR_RADIUS/> 范围内的周围敌人造成 3 点伤害</ font> 方块，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font> 忽略冷却时间不会伤害附近的盟友。"
LocPromotionPopupText = "<Ability:ClassName/> 消耗垂死对手留下的灵能能量，并发射灵能爆炸，对 <font color='#3ABD23'><Ability:PERVADING_DEVOUR_RADIUS/> 范围内的周围敌人造成 3 点伤害</ font> 方块，<font color='#3ABD23'><Ability:DEVOUR_COOLDOWN/></font> 忽略冷却时间不会伤害附近的盟友。"


[KPP_Phase X2AbilityTemplate]
LocFriendlyName ="阶段"
LocFlyOverText ="相位"
LocHelpText = "<Ability:ClassName/> 具有 <font color='#3ABD23'>+<Ability:PHASE_MOBILITY/></font> 移动能力，并且可以穿墙。"
LocLongDescription = "<Ability:ClassName/> 具有 <font color='#3ABD23'>+<Ability:PHASE_MOBILITY/></font> 移动能力，并且可以穿墙。"
LocPromotionPopupText = "<Ability:ClassName/> 具有 <font color='#3ABD23'>+<Ability:PHASE_MOBILITY/></font> 移动能力，并且可以穿墙。"

[WallPhasing X2AbilityTemplate]
LocFriendlyName="阶段"
LocFlyOverText="相位"
LocHelpText = "<Ability:ClassName/> 具有 <font color='#3ABD23'>+<Ability:PHASE_MOBILITY/></font> 移动能力，并且可以穿墙。"
LocLongDescription = "<Ability:ClassName/> 具有 <font color='#3ABD23'>+<Ability:PHASE_MOBILITY/></font> 移动能力，并且可以穿墙。"
LocPromotionPopupText = "<Ability:ClassName/> 具有 <font color='#3ABD23'>+<Ability:PHASE_MOBILITY/></font> 移动能力，并且可以穿墙。"

; - 收割者侦察兵 -

[KPP_Recon X2AbilityTemplate]
LocFriendlyName ="侦察专家"
LocFlyOverText ="侦察专家"
LocHelpText = "获得一个免费的战斗扫描仪并获得+8的视野和武器射程加值。"
LocLongDescription ="获得一个免费的战斗扫描仪并获得+8的视野和武器射程加值。"
LocPromotionPopupText = "获得一个免费的战斗扫描仪，并获得 +8 的视野和武器射程加值。"

[KPP_NimbleOperative X2AbilityTemplate]
LocFriendlyName ="敏捷特工"
LocFlyOverText = "敏捷特工"
LocHelpText = "<Ability:ClassName/> 被赋予 <font color='#3ABD23'>+<Ability:NIMBLE_OPERATIVE_MOBILITY/></font> 移动性并被赋予抓斗。"
LocLongDescription = "<Ability:ClassName/> 被赋予 <font color='#3ABD23'>+<Ability:NIMBLE_OPERATIVE_MOBILITY/></font> 移动性并被赋予抓斗。"
LocPromotionPopupText = "<Ability:ClassName/> 被赋予 <font color='#3ABD23'>+<Ability:NIMBLE_OPERATIVE_MOBILITY/></font> 移动性并被赋予抓斗。"

[KPP_PlusOne X2AbilityTemplate]
LocFriendlyName ="加一"
LocFlyOverText ="加一"
LocHelpText = "<Ability:ClassName/> 使用前所未见的战术并获得 <font color='#3ABD23'>+<Ability:PLUS_ONE_AMMO_BONUS/></font> 弹匣大小。"
LocLongDescription = "<Ability:ClassName/> 使用前所未见的战术并获得 <font color='#3ABD23'>+<Ability:PLUS_ONE_AMMO_BONUS/></font> 弹匣大小。"
LocPromotionPopupText = "<Ability:ClassName/> 使用前所未见的战术并获得 <font color='#3ABD23'>+<Ability:PLUS_ONE_AMMO_BONUS/></font> 弹匣大小。"

[KPP_Disorienting X2AbilityTemplate]
LocFriendlyName ="迷失方向射击"
LocFlyOverText ="迷失方向的射击"
LocHelpText = "从你的手枪中发射一枚特殊的子弹，使目标迷失方向。不会伤害目标。"
LocLongDescription = "从你的手枪中发射一枚特殊的子弹，使目标迷失方向。不会伤害目标。"
LocPromotionPopupText = "从你的手枪中发射一枚特殊的子弹，使目标迷失方向。不会伤害目标。"

[KPP_Flash X2AbilityTemplate]
LocFriendlyName ="闪光充电"
LocFlyOverText ="闪光充电"
LocHelpText = "<Ability:ClassName/> 在回合结束时添加了一个独特的冲锋，使迷失方向射击影响多个目标。"
LocLongDescription = "<Ability:ClassName/> 在回合结束时添加了一个独特的冲锋，使迷失射击影响多个目标。"
LocPromotionPopupText = "<Ability:ClassName/> 在回合结束时添加了一个独特的冲锋，使迷失方向射击影响多个目标。"

[KPP_FlashShot X2AbilityTemplate]
LocFriendlyName ="迷失方向射击：闪光冲锋"
LocFlyOverText ="迷失方向射击：闪光冲锋"
LocHelpText = "从你的手枪中发射一枚特殊的子弹，使目标周围的所有敌人迷失方向。不会伤害目标。"
LocLongDescription = "从你的手枪中发射一枚特殊的子弹，使目标周围的所有敌人迷失方向。不会伤害目标。"
LocPromotionPopupText = "从你的手枪中发射一枚特殊的子弹，使目标周围的所有敌人迷失方向。不会伤害目标。"

[KPP_Immobilize X2AbilityTemplate]
LocFriendlyName ="定身射击"
LocFlyOverText = "固定射击"
LocHelpText = "从你的手枪中发射一枚特殊子弹，使目标无法动弹，使其在 <font color='#3ABD23'><Ability:IMMOBILIZE_DURATION/></font> 回合内无法移动。不能对机器人敌人使用。"
LocLongDescription ="从你的手枪中发射一枚特殊的子弹，使目标无法动弹，使其无法移动。不能用于对付机器人敌人。"
LocPromotionPopupText = "从你的手枪中发射一枚特殊的子弹，使目标无法动弹，使其无法移动。不能用于对付机器人敌人。"

[KPP_Disable_Immobilize X2AbilityTemplate]
LocFriendlyName ="禁用射击"
LocFlyOverText ="禁用射击"
LocHelpText = "从你的手枪中发射一枚特殊子弹，击晕目标进行 <font color='#3ABD23'><Ability:DISABLE_STUN_ACTIONS/></font> 动作，并使其无法动弹进行 <font color='#3ABD23'><Ability :DISABLE_DURATION/></font> 回合可用于机器人目标。"
LocLongDescription = "改进定身射击，使其具有增强效果：从手枪中发射一枚特殊子弹，使目标昏迷 <font color='#3ABD23'><Ability:DISABLE_STUN_ACTIONS/></font> 动作，并使其定身 < font color='#3ABD23'><Ability:DISABLE_DURATION/></font> 回合可用于机器人目标。"
LocPromotionPopupText = "改进定身射击，使其具有增强效果：从手枪中发射一枚特殊子弹，使目标昏迷 <font color='#3ABD23'><Ability:DISABLE_STUN_ACTIONS/></font> 动作，并使其定身 < font color='#3ABD23'><Ability:DISABLE_DURATION/></font> 回合可用于机器人目标。"

[KPP_Acidic X2AbilityTemplate]
LocFriendlyName ="酸性射击"
LocFlyOverText ="酸性射击"
LocHelpText = "从你的手枪中发射一发特殊子弹，使目标无法动弹，使其在 <font color='#3ABD23'><Ability:IMMOBILIZE_DURATION/></font> 回合内无法移动，并应用 <font color='#3ABD23 '><Ability:ACID_DAMAGE/></font> 酸烧伤可用于机器人敌人。"
LocLongDescription = "改进定身射击，使其具有增强效果：从你的手枪中发射一枚特殊的子弹，定身目标，使他们在 <font color='#3ABD23'><Ability:IMMOBILIZE_DURATION/></font> 内无法移动转动并施加<font color='#3ABD23'><Ability:ACID_DAMAGE/></font>酸烧伤可用于机器人敌人。"
LocPromotionPopupText = "改进定身射击，使其具有增强效果：从你的手枪中发射一枚特殊的子弹，定身目标，使他们在 <font color='#3ABD23'><Ability:IMMOBILIZE_DURATION/></font> 内无法移动转动并施加<font color='#3ABD23'><Ability:ACID_DAMAGE/></font>酸烧伤可用于机器人敌人。"

[KPP_Terror X2AbilityTemplate]
LocFriendlyName ="恐怖射击"
LocFlyOverText ="恐怖射击"
LocHelpText = "从你的手枪中发射一枚特殊的子弹，使目标陷入恐慌。不能对机器人敌人使用。"
LocLongDescription ="改进定身射击，使其具有增强效果：从你的手枪中发射一枚特殊的子弹，使目标陷入恐慌。不能对机器人敌人使用。"
LocPromotionPopupText = "改进定身射击，使其具有增强效果：从你的手枪中发射一枚特殊的子弹，使目标陷入恐慌。不能对机器人敌人使用。"

; - 散兵哨兵 -

[KPP_VentRound X2AbilityTemplate]
LocFriendlyName ="通风轮"
LocFlyOverText ="通风轮"
LocHelpText = "进行不需要弹药的标准射击。"
LocLongDescription = "<Ability:ClassName/> 的主要武器允许生成标准子弹，从而可以在不使用弹药的情况下使用它们的<Ability:WeaponName/>。"
LocPromotionPopupText = "<Ability:ClassName/> 的主要武器允许生成标准子弹，从而允许在不使用弹药的情况下使用它们的<Ability:WeaponName/>。"

[KPP_IncendiaryRound X2AbilityTemplate]
LocFriendlyName ="燃烧弹"
LocFlyOverText ="燃烧弹"
LocHelpText = "进行一次标准射击，使目标着火，每回合造成<font color='#3ABD23'><Ability:INCENDIARY_BURN_DAMAGE/></font>伤害，不需要弹药。"
LocLongDescription ="升级通风弹，使他们的主武器生成燃烧弹，使敌人每回合燃烧<font color='#3ABD23'><Ability:INCENDIARY_BURN_DAMAGE/></font>伤害，不需要弹药。"
LocPromotionPopupText = "升级通风弹，让他们的主武器生成燃烧弹，让敌人着火，每回合造成 <font color='#3ABD23'><Ability:INCENDIARY_BURN_DAMAGE/></font> 伤害，不需要弹药。"

[KPP_FullMetalRound X2AbilityTemplate]
LocFriendlyName ="全金属外壳弹"
LocFlyOverText ="全金属外壳弹"
LocHelpText = "进行标准射击，刺穿<font color='#3ABD23'><Ability:FMJ_PIERCE/></font>护甲，造成<font color='#3ABD23'>+<Ability:FMJ_RUPTURE/></font > 造成伤害，并使目标破裂，造成 <font color='#3ABD23'>+<Ability:FMJ_RUPTURE/></font> 伤害，不需要弹药。"
LocLongDescription ="升级发泄弹，使其主武器生成 FMJ 弹，可刺穿<font color='#3ABD23'><Ability:FMJ_PIERCE/></font>盔甲，破裂<font color='#3ABD23'>+<能力：FMJ_RUPTURE/></font> 伤害，并造成 <font color='#3ABD23'>+<Ability:FMJ_RUPTURE/></font> 伤害，不需要弹药。"
LocPromotionPopupText = "升级通风弹，使其主要武器生成 FMJ 弹，可刺穿<font color='#3ABD23'><Ability:FMJ_PIERCE/></font>盔甲，破裂<font color='#3ABD23'>+<能力：FMJ_RUPTURE/></font> 伤害，并造成 <font color='#3ABD23'>+<Ability:FMJ_RUPTURE/></font> 伤害，不需要弹药。"

[KPP_LightningRound X2AbilityTemplate]
LocFriendlyName ="闪电弹"
LocFlyOverText ="闪电轮"
LocHelpText = "进行一次标准射击，对机器人单位造成更多伤害，并击晕目标进行<font color='#3ABD23'><Ability:LIGHTNING_STUN_ACTIONS/></font>动作，不需要弹药。"
LocLongDescription = "升级通风弹，使其主武器产生闪电弹，对机器人单位造成更多伤害，并击晕目标进行<font color='#3ABD23'><Ability:LIGHTNING_STUN_ACTIONS/></font>动作，不需要弹药。"
LocPromotionPopupText = "升级通风弹，使其主武器生成闪电弹，对机器人单位造成更多伤害，并击晕目标进行<font color='#3ABD23'><Ability:LIGHTNING_STUN_ACTIONS/></font>动作，不需要弹药。"

[KPP_HollowPointRound X2AbilityTemplate]
LocFriendlyName ="空心点弹"
LocFlyOverText ="空心点回合"
LocHelpText = "进行一次标准射击，使目标流血 <font color='#3ABD23'><Ability:HOLLOW_POINT_BLEED_DAMAGE/></font> 伤害，但造成 <font color='#3ABD23'><Ability:HOLLOW_POINT_PIERCE/> </font> 穿甲弹无法用于机器人单位，也不需要弹药。"
LocLongDescription = "<Ability:ClassName/> 的主要武器升级为允许生成空心弹，允许其 <Ability:WeaponName/> 发射流血目标但具有 <font color='#3ABD23'> 的子弹<能力：HOLLOW_POINT_PIERCE/></font>穿甲。"
LocPromotionPopupText = "<Ability:ClassName/> 的主要武器升级为允许生成空心弹，允许其 <Ability:WeaponName/> 发射流血目标但具有 <font color='#3ABD23'> 的子弹<能力：HOLLOW_POINT_PIERCE/></font>穿甲。"

[KPP_RubberRound X2AbilityTemplate]
LocFriendlyName ="橡胶弹"
LocFlyOverText ="橡胶弹"
LocHelpText = "进行一次标准射击，击中时使目标迷失方向，并且不需要弹药，无法对机器人单位使用。"
LocLongDescription = "<Ability:ClassName/> 的主要武器已升级，可以以某种方式生成橡胶弹，从而允许其 <Ability:WeaponName/> 发射子弹，击中时使目标迷失方向，无法用于机器人单位，不需要弹药。"
LocPromotionPopupText = "<Ability:ClassName/> 的主要武器已升级，可以以某种方式生成橡胶弹，允许其 <Ability:WeaponName/> 发射子弹，击中时使目标迷失方向，无法用于机器人单位，不需要弹药。"

[KPP_AutoLoader X2AbilityTemplate]
LocFriendlyName ="集成自动加载器"
LocFlyOverText ="集成自动加载器"
LocHelpText = "重新加载 <font color='#3ABD23'><Ability:AUTO_LOADER_AMMO_TO_RELOAD/></font> 轮。"
LocLongDescription = "<Ability:ClassName/> 的主武器升级为集成式自动装弹机，允许用户重新装弹 <font color='#3ABD23'><Ability:AUTO_LOADER_AMMO_TO_RELOAD/></font> 轮每 <font color='#3ABD23'><Ability:AUTO_LOADER_COOLDOWN/></font> 轮可自由行动。"
LocPromotionPopupText = "<Ability:ClassName/> 的主要武器通过集成自动装弹机进行升级，允许用户重新装弹 <font color='#3ABD23'><Ability:AUTO_LOADER_AMMO_TO_RELOAD/></font> 轮每 <font color='#3ABD23'><Ability:AUTO_LOADER_COOLDOWN/></font> 轮可自由行动。"

[KPP_LargerMagazine X2AbilityTemplate]
LocFriendlyName ="更大的杂志"
LocFlyOverText ="更大的杂志"
LocHelpText ="获得<font color='#3ABD23'>+<Ability:LARGER_MAGAZINE_AMMO_BONUS/></font>弹匣大小，以实现<font color='#3ABD23'><Ability:LARGER_MAGAZINE_MOBILITY/></font>移动性。"
LocLongDescription = "<Ability:ClassName/> 牺牲其机动性以获得额外回合，获得 <font color='#3ABD23'>+<Ability:LARGER_MAGAZINE_AMMO_BONUS/></font> 弹匣大小 <font color='#3ABD23'> <能力：LARGER_MAGAZINE_MOBILITY/></font>移动性。"
LocPromotionPopupText = "<Ability:ClassName/> 牺牲其机动性以获得额外回合，获得 <font color='#3ABD23'>+<Ability:LARGER_MAGAZINE_AMMO_BONUS/></font> 弹匣大小，以增加 <font color='#3ABD23'> <能力：LARGER_MAGAZINE_MOBILITY/></font>移动性。"

[KPP_LockedDown X2AbilityTemplate]
LocFriendlyName ="锁定"
LocFlyOverText ="锁定"
LocHelpText = "用户锁定自己的位置，获得<font color='#3ABD23'>+<Ability:LOCKED_DOWN_DEFENSE/></font>防御力和<font color='#3ABD23'>+<Ability:LOCKED_DOWN_DODGE/>< /font> 闪避 <font color='#3ABD23'><Ability:LOCKED_DOWN_DURATION/></font> 回合并重新装填武器，但无法移动 <font color='#3ABD23'><Ability:LOCKED_DOWN_DURATION/ ></font> 回合，用户必须处于掩体中才能激活。"
LocLongDescription = "<Ability:ClassName/> 锁定其位置，提供 <font color='#3ABD23'>+<Ability:LOCKED_DOWN_DEFENSE/></font> 防御和 <font color='#3ABD23'>+<Ability :LOCKED_DOWN_DODGE/></font> 闪避 <font color='#3ABD23'><Ability:LOCKED_DOWN_DURATION/></font> 回合并重新装填武器，但无法移动 <font color='#3ABD23'><Ability :LOCKED_DOWN_DURATION/></font> 回合，用户必须处于掩体中才能激活。"
LocPromotionPopupText = "<Ability:ClassName/>锁定他们的位置，提供<font color='#3ABD23'>+<Ability:LOCKED_DOWN_DEFENSE/></font>防御和<font color='#3ABD23'>+<Ability :LOCKED_DOWN_DODGE/></font> 闪避 <font color='#3ABD23'><Ability:LOCKED_DOWN_DURATION/></font> 回合并重新装填武器，但无法移动 <font color='#3ABD23'><Ability :LOCKED_DOWN_DURATION/></font> 回合，用户必须处于掩体中才能激活。"

; - 动画适用 -

[KPP_WardenAnimApply X2AbilityTemplate]
LocFriendlyName ="典狱长动画应用"
LocFlyOverText ="守望者动画应用"
LocHelpText ="这个被动将守望者动画添加到你的士兵中。你不应该看到这个。这实际上是我能找到的唯一解决办法来让它工作。"
LocLongDescription ="这个被动为你的士兵添加了守望者动画。你不应该看到这个。这实际上是我能找到的唯一解决办法来让它工作。"
LocPromotionPopupText ="这个被动将守望者动画添加到你的士兵中。你不应该看到这个。这实际上是我能找到的唯一解决办法来让它工作。"

[KPP_TemplarKnightAnimApply X2AbilityTemplate]
LocFriendlyName ="圣殿骑士动画应用"
LocFlyOverText ="圣殿骑士动画应用"
LocHelpText ="这个被动将圣殿骑士动画添加到你的士兵中。你不应该看到这个。这实际上是我能找到的唯一解决办法来让它工作。"
LocLongDescription ="这个被动为你的士兵添加了圣殿骑士动画。你不应该看到这个。这实际上是我能找到的唯一解决办法来让它工作。"
LocPromotionPopupText ="这个被动将圣殿骑士动画添加到你的士兵中。你不应该看到这个。这实际上是我能找到的唯一解决办法来让它工作。"

[KPP_TemplarKnightAnimApplyXCOM X2AbilityTemplate]
LocFriendlyName ="圣殿骑士动画应用 XCOM"
LocFlyOverText ="圣殿骑士动画应用 XCOM"
LocHelpText ="这个被动将圣殿骑士动画添加到你的士兵中。这个动画应用适用于普通的XCOM士兵，而不是圣殿骑士。你不应该看到这个。这实际上是我能找到的唯一解决办法来让它工作"。
LocLongDescription ="这个被动将圣殿骑士动画添加到你的士兵中。这个动画应用适用于普通的 XCOM 士兵，而不是圣殿骑士。你不应该看到这个。这实际上是我能找到的唯一解决办法来让它工作"。
LocPromotionPopupText ="这个被动将圣殿骑士动画添加到你的士兵中。这个动画应用适用于普通的XCOM士兵，而不是圣殿骑士。你不应该看到这个。这实际上是我能找到的唯一解决办法来让它工作"。

; - 自定义能力 -
[KPP_Critical_Focus X2AbilityTemplate]
LocFriendlyName ="关键焦点"
LocHelpText = "使用主武器开火可获得<font color='#3ABD23'><Ability:CRITICAL_FOCUS_GAIN_DIRECT_SHOT/></font>关键焦点堆栈，将用户副武器的暴击命中率提高<font color='#3ABD23'>每叠加 <Ability:CRITICAL_FOCUS_CRIT_CHANCE_BONUS/>%</font> 反应火力可获得 <font color='#3ABD23'><Ability:CRITICAL_FOCUS_GAIN_REACTION_SHOT/></font> 次要武器获得 <font color='# 3ABD23'>+<Ability:CRITICAL_FOCUS_DAMAGE_BONUS/></font> 每 <font color='#3ABD23'><Ability:CRITICAL_FOCUS_DAMAGE_BONUS_CHARGE_DIVISOR/></font> 层暴击专注造成伤害（最多 +2 点伤害）。每回合开始都会失去关键焦点堆栈。"
LocLongDescription ="使用主武器开火可获得<font color='#3ABD23'><Ability:CRITICAL_FOCUS_GAIN_DIRECT_SHOT/></font>暴击焦点叠加，将用户副武器的暴击命中率提高<font color='#3ABD23'>每叠加 <Ability:CRITICAL_FOCUS_CRIT_CHANCE_BONUS/>%</font> 反应火力可获得 <font color='#3ABD23'><Ability:CRITICAL_FOCUS_GAIN_REACTION_SHOT/></font> 次要武器获得 <font color='# 3ABD23'>+<Ability:CRITICAL_FOCUS_DAMAGE_BONUS/></font> 每 <font color='#3ABD23'><Ability:CRITICAL_FOCUS_DAMAGE_BONUS_CHARGE_DIVISOR/></font> 层暴击专注造成伤害（最多 +2 点伤害）。每回合开始都会失去关键焦点堆栈。"
LocPromotionPopupText = "使用主武器开火可获得<font color='#3ABD23'><Ability:CRITICAL_FOCUS_GAIN_DIRECT_SHOT/></font>关键焦点堆栈，将用户副武器的暴击命中率提高<font color='#3ABD23'>每叠加 <Ability:CRITICAL_FOCUS_CRIT_CHANCE_BONUS/>%</font> 反应火力可获得 <font color='#3ABD23'><Ability:CRITICAL_FOCUS_GAIN_REACTION_SHOT/></font> 次要武器获得 <font color='# 3ABD23'>+<Ability:CRITICAL_FOCUS_DAMAGE_BONUS/></font> 每 <font color='#3ABD23'><Ability:CRITICAL_FOCUS_DAMAGE_BONUS_CHARGE_DIVISOR/></font> 层暴击专注造成伤害（最多 +2 点伤害）。每回合开始都会失去关键焦点堆栈。"
